ERP.belugaerp/src/InformationRegisters/бг_НастройкиКорректировкиЗаказовБезСнятияСогласования/бг_НастройкиКорректировкиЗаказовБезСнятияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиКорректировкиЗаказовБезСнятияСогласования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КаналПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиКорректировкиЗаказовБезСнятияСогласования/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ОтменитьСогласование(ДокументЗаказ, Дата) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаказ, "Дата, Организация, бг_ПунктНазначения.КаналПродаж");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"	, НачалоДня(Дата));
	Запрос.УстановитьПараметр("КаналПродаж"		, РеквизитыДокумента.бг_ПунктНазначенияКаналПродаж);
	Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.бг_НастройкиКорректировкиЗаказовБезСнятияСогласования.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И КаналПродаж = &КаналПродаж
		|				И &ДатаДокумента <= КонецПериода) КАК ДанныеРегистра";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
		
КонецФункции

#КонецОбласти
